Repository: gabbrenn/garage-service-platform
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: rw

# appTitle
source: Garage Service App
rw: Porogaramu ya Serivisi zi Garage

# splashTagline
source: Find nearby garage services
rw: Shakisha serivisi zi gareji hafi yawe

# loginTitle
source: Login
rw: Injira

# loginEmail
source: Email
rw: Imeli

# loginPassword
source: Password
rw: Ijambobanga

# loginButton
source: Sign In
rw: Injira

source: Logout
rw: Sohoka

source: Cancel
rw: Kureka

# confirmLogoutMessage
source: Are you sure you want to logout?
rw: Uremeza ko ushaka gusohoka?

source: My Requests
rw: Ubusabe bwanjye

source: Notifications
rw: Amatangazo

source: Garage Dashboard
rw: Ibiro byi Garage

source: Language
rw: Ururimi

source: Choose Language
rw: Hitamo ururimi

source: Find Garages
rw: Shakisha Igarage

source: List
rw: Urutonde

source: Map
rw: Ikarita

source: Location
rw: Aho uri

# gettingLocation
source: Getting your location...
rw: Turi kubona aho uri...

source: Error loading garages
rw: Hajemo ikibazo mugushakisha igarage

source: Retry
rw: Ongera ugerageze

# noGaragesFound
source: No garages found nearby
rw: Nta garage rigaragaye hafi

# tryRefresh
source: Try refreshing or check your location
rw: Gerageza wongere cyangwa urebe aho uri

source: Waiting for location...
rw: Tegereza aho uri...

source: You
rw: Wowe

source: Distance
rw: Intera

source: Details
rw: Ibisobanuro

source: Directions
rw: Amabwiriza

source: View Services
rw: Reba serivisi

# myRequestsMenu
source: My Requests
rw: Ubusabe bwanjye

source: Set Up Your Garage
rw: Shyiraho Igarage Ryawe

# createGarageProfile
source: Create your garage profile to start receiving service requests from customers.
rw: Uzuza umwirondoro w'igarage ryawe utangire kwakira ubusabe bwa serivisi.

# setUpGarageButton
source: Set Up Garage
rw: Shyiraho Garage

source: Services
rw: Serivisi

source: Requests
rw: Ubusabe

source: Manage Services
rw: Tunganya serivisi

source: Edit Profile
rw: Hindura profayili

source: View Requests
rw: Reba ubusabe

source: Add Service
rw: Ongeraho serivisi

source: View Report
rw: Reba raporo

source: Recent Requests
rw: Ubusabe bushya

source: No requests yet
rw: Nta busabe buraboneka

# requestsAppearHere
source: Service requests will appear here
rw: Ubusabe bwa serivisi buzagaragara hano

source: Unknown Customer
rw: Umukiriya utazwi

# statusPending
source: Pending
rw: Bitegereje

# statusAccepted
source: Accepted
rw: Byemejwe

# statusRejected
source: Rejected
rw: Byanzwe

# welcomeBack
source: Welcome To Mechanical Assistant
rw: Murakaza neza ku Mufasha w'Imashini

# signInSubtitle
source: Sign in to your account
rw: Injira kuri konti yawe

# emailRequired
source: Please enter your email
rw: Andika imeli yawe

# emailInvalid
source: Please enter a valid email
rw: Shyiramo imeli yemewe

# passwordRequired
source: Please enter your password
rw: Shyiramo ijambobanga

source: Login failed
rw: Kwinjira byanze

# dontHaveAccount
source: Don't have an account?
rw: Nta konti ufite?

source: Sign Up
rw: Iyandikishe

source: Join Garage Service
rw: Injira muri Garage Service

# createAccountTitle
source: Create Account
rw: Fungura Konti

source: First Name
rw: Izina rya mbere

source: Last Name
rw: Izina rya nyuma

# requiredField
source: Required
rw: Birasabwa

source: Phone Number
rw: Nimero ya telefoni

# phoneRequired
source: Please enter your phone number
rw: Shyiramo nimero ya telefoni

source: Customer
rw: Umukiriya

source: Garage Owner
rw: Nyir'igaraji

source: Password
rw: Ijambobanga

source: Confirm Password
rw: Emeza ijambobanga

# confirmPasswordRequired
source: Please confirm your password
rw: Emeza ijambobanga ryawe

# passwordTooShort
source: Password must be at least 6 characters
rw: Ijambobanga rigomba nibura inyuguti 6

source: Passwords do not match
rw: Ijambobanga ntirihuye

# registrationSuccess
source: Registration successful! Please sign in.
rw: Kwiyandikisha byagenze neza! Injira.

source: Registration failed
rw: Kwiyandikisha byanze

# createAccountButton
source: Create Account
rw: Fungura Konti

source: Sign In
rw: Injira

source: Save
rw: Bika

source: Save Changes
rw: Bika impinduka

source: Delete
rw: Siba

# deleteServiceTitle
source: Delete Service
rw: Siba Serivisi

# deleteServiceConfirm
source: Are you sure you want to delete "{serviceName}"?
rw: Uremeza ko ushaka gusiba "{serviceName}"?

# serviceDeletedSuccess
source: Service deleted
rw: Serivisi yasibwe

# serviceDeleteFailed
source: Failed to delete
rw: Gusiba byanze

# serviceAddedSuccess
source: Service added successfully!
rw: Serivisi yongewe!

# serviceAddFailed
source: Failed to add service
rw: Byanze kongeraho serivisi

# serviceUpdatedSuccess
source: Service updated
rw: Serivisi yavuguruwe

# serviceUpdateFailed
source: Failed to update
rw: Kuvugurura byanze

# addServiceTitle
source: Add Service
rw: Ongeraho Serivisi

# addNewServiceHeading
source: Add New Service
rw: Ongeraho Serivisi Nshya

# garageCreatedSuccess
source: Garage created successfully!
rw: Igarage ryashyizweho!

# garageCreateFailed
source: Failed to create garage
rw: Kwandikisha igarage byanze

# garageUpdatedSuccess
source: Garage updated
rw: Igarage ryavuguruwe

# garageUpdateFailed
source: Failed to update
rw: Kuvugurura igarage byanze

# locationPermissionRequiredFind
source: Location permission is required to find nearby garages
rw: Uruhushya rw'ahantu rurakenewe kugira ngo tubone garage hafi

# locationPermissionRequiredSetup
source: Location permission is required to set up garage
rw: Uruhushya rw'ahantu rurakenewe kugira ngo ushireho garage

source: Failed to get location
rw: Ntitwabonye aho uri

# failedToGetLocationWithError
source: Failed to get location: {error}
rw: Ntitwabonye aho uri: {error}

# locationRequiredSubmitRequest
source: Location is required to submit request
rw: Aho uri harakenewe kugira ngo wohereze ubusabe

# locationRequiredCreateGarage
source: Location is required to create garage
rw: Aho uri harakenewe kugira ngo ushireho garage

# locationSelectedSuccess
source: Location selected
rw: Aho uri hemejwe

# useLocation
source: Use
rw: Koresha

source: Recenter
rw: Subira hagati

# gpsFixed
source: GPS Fix
rw: GPS yatunganyijwe

# requestServiceTitle
source: Request Service
rw: Saba Serivisi

# serviceRequestSubmittedSuccess
source: Service request submitted successfully!
rw: Ubusabe bwoherejwe!

# serviceRequestSubmitFailed
source: Failed to submit request
rw: Gohereza byanze

source: Customer location not provided
rw: Aho umukiriya ari ntihaboneka

source: Garage location not loaded
rw: Aho garage iri ntibirajya

source: Accept
rw: Emera

source: Reject
rw: Hakana

# requestRespondAcceptSuccess
source: Request accepted successfully!
rw: Ubusabe bwakiriwe!

# requestRespondRejectSuccess
source: Request rejected successfully!
rw: Ubusabe bwanzwe!

# requestRespondFailed
source: Failed to respond to request
rw: Gusubiza byanze

# requestStatusUpdateSuccess
source: Request status updated successfully!
rw: Imiterere y'ubusabe yavuguruwe!

# requestStatusUpdateFailed
source: Failed to update request
rw: Kuvugurura imiterere byanze

# requestRespondGenericSuccess
source: Request {status} successfully!
rw: Ubusabe {status}!

# shareFailedWithError
source: Share failed: {error}
rw: Gusangira byanze: {error}

# exportFailedWithError
source: Export failed: {error}
rw: Kohereza hanze byanze: {error}

# csvDownloadedAndCopied
source: CSV downloaded (browser) and copied to clipboard
rw: CSV yakuruwemo (mucunguwe) kandi yanditswe muri clipboard

# csvSavedAndCopiedWithPath
source: CSV saved to: {path} Also copied to clipboard
rw: CSV yabitswe: {path} Kandi yanditswe muri clipboard

# reportCsvHeaderTitle
source: GARAGE DAILY REPORT
rw: RAPORO YA BURI MUNSI YI GARAGE

# reportCsvGeneratedAt
source: Generated At
rw: Byakozwe ku

# reportCsvPeriodStart
source: Period Start
rw: Itangiriro ry'igihe

# reportCsvPeriodEnd
source: Period End
rw: Iherezo ry'igihe

# reportCsvTotalDays
source: Total Days
rw: Iminsi yose

# reportCsvTotalRequests
source: Total Requests
rw: Ubusabe bwose

# reportCsvAvgRequestsPerDay
source: Avg Requests/Day
rw: Impuzandengo y'ubusabe/umunsi

# reportCsvOverallAvgEta
source: Overall Avg ETA (min)
rw: Impuzandengo rusange ya ETA (min)

# reportCsvColumnDate
source: Date
rw: Itariki

# reportCsvColumnPending
source: PENDING
rw: BITEGEREJE

# reportCsvColumnAccepted
source: ACCEPTED
rw: BYEMEJWE

# reportCsvColumnInProgress
source: IN_PROGRESS
rw: BIRI GUKORWA

# reportCsvColumnCompleted
source: COMPLETED
rw: BYARANGIJE

# reportCsvColumnRejected
source: REJECTED
rw: BYANZWE

# reportCsvColumnCancelled
source: CANCELLED
rw: BYAHAGARITSWE

# reportCsvColumnTotal
source: TOTAL
rw: BYOSE

# reportCsvColumnAvgEta
source: Avg ETA (min)
rw: Impuzandengo ya ETA (min)

# shareGarageReportText
source: Garage Daily Report
rw: Raporo ya buri munsi ya Garage

source: Clipboard copy failed
rw: Kwemeza kopi byanze

# genericSuccess
source: Success
rw: Byagenze neza

# genericError
source: Error
rw: Ikosa

source: No services yet
rw: Nta serivisi zirahari

# addFirstServiceMessage
source: Add your first service to start receiving requests
rw: Ongeraho serivisi ya mbere utangire kwakira ubusabe

source: No description
rw: Nta bisobanuro

# editServiceTitle
source: Edit Service
rw: Hindura Serivisi

source: Name
rw: Izina

# nameRequired
source: Name is required
rw: Izina rirakenewe

# descriptionLabel
source: Description
rw: Ibisobanuro

source: Price
rw: Igiciro

# priceRequired
source: Price is required
rw: Igiciro kirakenewe

source: Invalid price
rw: Igiciro si cyo

# durationMinutes
source: Duration (min)
rw: Iminota

source: Invalid duration
rw: Igihe si cyo

# serviceNameLabel
source: Service Name *
rw: Izina rya Serivisi *

# serviceNameHint
source: e.g., Oil Change, Tire Repair, Engine Diagnostic
rw: Urugero: Gusimbuza amavuta, Gukora ipine, Gusuzuma moteri

# serviceNameRequired
source: Please enter service name
rw: Shyiramo izina rya serivisi

# serviceDescriptionOptional
source: Description (Optional)
rw: Ibisobanuro (si ngombwa)

# serviceDescriptionHint
source: Describe what this service includes
rw: Sobanura ibyo iyi serivisi irimo

# priceHint
source: Enter price in dollars
rw: Andika igiciro mu madolari

# enterValidPrice
source: Please enter a valid price
rw: Shyiramo igiciro gikwiye

source: Estimated Duration (Optional)
rw: Igihe cy'ikorwa (si ngombwa)

# durationMinutesHint
source: Duration in minutes
rw: Iminota

# enterValidDuration
source: Please enter a valid duration
rw: Shyiramo igihe gikwiye

# serviceTipsTitle
source: Service Tips
rw: Inama za Serivisi

# serviceTipsBullets
source: • Be specific about what the service includes • Set competitive prices for your area • Provide realistic time estimates • You can edit or remove services later
rw: • Ba w'umwihariko ku byo serivisi ikubiyemo • Shyiraho ibiciro bihuye n'akarere kawe • Tanga igihe nyacyo gitegerejwe • Ushobora guhindura cyangwa gukuraho serivisi nyuma

# createGarageTitle
source: Create Garage
rw: Himba Garage

# garageNameLabel
source: Garage Name
rw: Izina rya Garage

# garageAddressLabel
source: Address
rw: Aderesi

# garageDescriptionLabel
source: Description
rw: Ibisobanuro

# garageWorkingHoursLabel
source: Working Hours
rw: Amasaha y'akazi

# editGarageTitle
source: Edit Garage
rw: Hindura Garage

# minutesUnit
source: minutes
rw: iminota

# addServiceDescription
source: Create a new service that customers can request from your garage.
rw: Himba serivisi nshya abakiriya bashobora gusaba.

source: Failed to load services
rw: Ntibyashobotse kubona serivisi

# selectedCoordinatesLabel
source: Selected: {lat}, {lng}
rw: Byahiswemo: {lat}, {lng}

# mapTapToChooseLocation
source: Tap on the map to choose location
rw: Kanda kuri karita uhitemo aho uri

# mapTapToSetLocation
source: Tap on map to set your location
rw: Kanda kuri karita ushireho aho uri

# createGarageProfileHeading
source: Create Your Garage Profile
rw: Himba Profayili yawe ya Garage

# createGarageProfileIntro
source: Fill in the details below to set up your garage and start receiving service requests.
rw: Uzuza ibisobanuro hasi ushireho garage yawe utangire kwakira ubusabe bwa serivisi.

# garageNameHint
source: Enter your garage name
rw: Andika izina rya garage yawe

# garageNameRequired
source: Please enter garage name
rw: Shyiramo izina rya garage

# garageAddressHint
source: Enter your garage address
rw: Andika aderesi yawe

# garageAddressRequired
source: Please enter address
rw: Shyiramo aderesi

# garageDescriptionHint
source: Describe your garage services and specialties
rw: Sobanura serivisi zawe n'ibyihariye

# garageWorkingHoursHint
source: e.g., Mon-Fri: 8AM-6PM, Sat: 8AM-4PM
rw: Urugero: Kuwa Mbere-Kuwa Gatanu: 8AM-6PM, Kuwa Gatandatu: 8AM-4PM

source: Fetching current location...
rw: Turi gukura aho uri...

# serviceDetailsHeading
source: Service Details
rw: Ibisobanuro bya Serivisi

# yourLocationHeading
source: Your Location
rw: Aho uri

# currentLocationLabel
source: Location: {lat}, {lng}
rw: Aho uri: {lat}, {lng}

source: Location not available
rw: Aho uri ntiboneka

# addressOptionalLabel
source: Address (Optional)
rw: Aderesi (Si ngombwa)

# addressOptionalHint
source: Enter your address for easier location
rw: Andika aderesi yawe byoroshye

# additionalDetailsHeading
source: Additional Details
rw: Andi makuru

# descriptionOptionalLabel
source: Description (Optional)
rw: Ibisobanuro (Si ngombwa)

# descriptionOptionalHint
source: Describe the issue or any special requirements
rw: Sobanura ikibazo cyangwa ibyo usaba bidasanzwe

# submitRequestButton
source: Submit Request
rw: Ohereza Ubusabe

# savingInProgress
source: Saving...
rw: Kubika...

# serviceRequestsTitle
source: Service Requests
rw: Ubusabe bwa Serivisi

source: Error loading requests
rw: Ikosa mu kubona ubusabe

# noRequestsYetLong
source: Service requests from customers will appear here
rw: Ubusabe bwa serivisi buzagaragara hano

# customerLocationTitle
source: Customer Location
rw: Aho Umukiriya Ari

# customerLabel
source: Customer
rw: Umukiriya

# addressLabel
source: Address
rw: Aderesi

# unknownCustomerLabel
source: Unknown Customer
rw: Umukiriya utazwi

# noPhoneLabel
source: No phone
rw: Nta telefoni

# servicePrefix
source: Service: {value}
rw: Serivisi: {value}

# descriptionPrefix
source: Description: {value}
rw: Ibisobanuro: {value}

source: Location not provided
rw: Aho uri ntihatanzwe

# requestedAtPrefix
source: Requested: {date}
rw: Byasabye: {date}

# yourResponseLabel
source: Your Response:
rw: Igisubizo cyawe:

source: View Location Map
rw: Reba Ikarita

source: Start Work
rw: Tangira Akazi

source: Mark Complete
rw: Shyira ko Byarangiye

# acceptRequestTitle
source: Accept Request
rw: Emera Ubusabe

# rejectRequestTitle
source: Reject Request
rw: Hakana Ubusabe

# responseMessageLabel
source: Response Message
rw: Ubutumwa bwo Gusubiza

# acceptDefaultResponse
source: We'll be there soon!
rw: Tuzahagera vuba!

# rejectDefaultResponse
source: Sorry, we cannot fulfill this request.
rw: Twababariwe, ntitwashobora kubikora.

# estimatedArrivalMinutesLabel
source: Estimated Arrival (minutes)
rw: Igihe cyo Kugera (iminota)

# minutesExampleHint
source: e.g., 30
rw: urugero: 30

# cancelButton
source: Cancel
rw: Kureka

source: Requests by Status (Daily)
rw: Ubusabe ku munsi hashingiwe ku miterere

source: Average ETA (Minutes)
rw: Impuzandengo ya ETA (iminota)

# summaryTitle
source: Summary
rw: Inshamake

# periodLabel
source: Period
rw: Igihe

# totalRequestsLabel
source: Total Requests
rw: Ubusabe bwose

# avgPerDayLabel
source: Avg / Day
rw: Impuzandengo/Umunsi

# avgEtaLabel
source: Avg ETA
rw: Impuzandengo ya ETA

# dailyBreakdownTitle
source: Daily Breakdown
rw: Isesengura rya buri munsi

# avgEtaPrefix
source: Avg ETA: {value}
rw: Impuzandengo ya ETA: {value}

# statusInProgress
source: In Progress
rw: Birigukorwa

# statusCompleted
source: Completed
rw: Byarangiye

# statusCancelled
source: Cancelled
rw: Byahagaritswe

# acceptRequestButton
source: Accept
rw: Emera

# rejectRequestButton
source: Reject
rw: Hakana

# startWorkButton
source: Start Work
rw: Tangira

# markCompleteButton
source: Mark Complete
rw: Byarangiye

# exportCsvTooltip
source: Export CSV
rw: Ohereza CSV

# shareSaveTooltip
source: Share/Save
rw: Sangiza/Bika

# selectDateRangeTooltip
source: Select Date Range
rw: Hitamo Igihe

# refreshTooltip
source: Refresh
rw: Vugurura

# dailyReportTitle
source: Daily Report
rw: Raporo ya buri munsi

# noDataLabel
source: No data
rw: Nta makuru

# generatedAtLabel
source: Generated At
rw: Byakoreshejwe ku

# periodStartLabel
source: Period Start
rw: Itangiriro

# periodEndLabel
source: Period End
rw: Iherezo

# totalDaysLabel
source: Total Days
rw: Iminsi yose

# exportFailedGeneric
source: Export failed
rw: Kohereza hanze byanze

# shareFailedGeneric
source: Share failed
rw: Gusangira byanze

# avgRequestsPerDayLabel
source: Avg Requests/Day
rw: Impuzandengo y'ubusabe/umunsi

# forgotPasswordTitle
source: Forgot password?
rw: Wibagiwe ijambobanga?

# forgotPasswordSubtitle
source: Enter your email and we'll send a reset link.
rw: Andika imeli yawe maze twohereze kode yo guhindura.

source: Send reset link
rw: Ohereza kode yo guhindura

# passwordResetEmailSent
source: If an account exists, a reset email has been sent
rw: Niba konti ibaho, imeli irimo kode yo guhindura yoherejwe

# devResetToken
source: DEV token
rw: Kode ya DEV

# goToResetWithToken
source: Open reset screen with this token
rw: Fungura urupapuro rwo guhindura ukoresheje iyi kode

# resetPasswordTitle
source: Reset Password
rw: Hindura Ijambobanga

# resetTokenLabel
source: Reset Token
rw: Kode yo guhindura

# tokenRequired
source: Token is required
rw: Kode irakenewe

source: New Password
rw: Ijambobanga rishya

source: Confirm New Password
rw: Emeza ijambobanga rishya

# resetPasswordCta
source: Reset Password
rw: Hindura Ijambobanga

# passwordResetSuccess
source: Password has been reset. Please sign in.
rw: Ijambobanga ryahinduwe. Nyamuneka injira.

# passwordCriteriaHeading
source: Password must include:
rw: Ijambobanga rigomba kuba ririmo:

# passwordCriterionMin
source: 8+ characters
rw: Inyuguti 8+

# passwordCriterionUpper
source: Uppercase letter
rw: Inyuguti nkuru

# passwordCriterionLower
source: Lowercase letter
rw: Inyuguti nto

# passwordCriterionDigit
source: Number
rw: Umubare

# passwordCriterionSpecial
source: Special character
rw: Ikimenyetso cyihariye

# passwordAddPrefix
source: Add: {missing}
rw: Ongeraho: {missing}

# passwordAllSet
source: All password requirements met
rw: Ibisabwa byose byuzuye

# errorEmailInUse
source: Email is already in use
rw: Imeli irakoreshejwe

# errorPhoneInUse
source: Phone number is already in use
rw: Telefoni irakoreshejwe

# errorInvalidCredentials
source: Invalid email or password
rw: Imeli cyangwa ijambobanga si byo

# errorGeneric
source: Something went wrong
rw: Habayeho ikibazo

# errorPasswordRequirements
source: Password does not meet requirements
rw: Ijambobanga ntiryujuje ibisabwa

# errorNetwork
source: Network error. Check your connection
rw: Ikosa rya interineti. Reba uko ihagaze

# errorServer
source: Server error. Please try again later
rw: Ikosa rya seriveri. Ongera ugerageze nyuma

# passwordCriteriaShort
source: Password needs: {missing}
rw: Ijambobanga rikeneye: {missing}
